# Два узла, находящиеся в разных подсетях, имеют IP-адреса 216.54.187.235 и 216.54.174.128.
# В масках обеих подсетей одинаковое количество единиц.
#
# Укажите наибольшее возможное количество единиц в масках этих подсетей.
# Учтите, что два адреса в любой подсети зарезервированы: адрес всей подсети и широковещательный адрес.

from ipaddress import *

for mask in range(32, -1, -1):
    net1 = ip_network(f'216.54.187.235/{mask}', False)
    net2 = ip_network(f'216.54.174.128/{mask}', False)

    if (net1 != net2 and '216.54.187.235' not in str(net1) and '216.54.174.128' not in str(net2) \
        and net1.broadcast_address != ip_address('216.54.187.235') and net2.broadcast_address != ip_address('216.54.174.128')):
        print(mask)