# Сеть, в которой содержится узел с IP-адресом 246.51.128.202, задана маской сети 255.255.𝐴.0, где 𝐴 - некоторое допустимое для записи маски число.
#
# Определите минимальное значение 𝐴, для которого для всех IP-адресов этой сети в двоичной записи
# IP-адреса суммарное количество нулей в левых двух байтах не более суммарного количества нулей в правых двух байтах.
#
# В ответе укажите только число.

from ipaddress import *

# 1 СПОСОБ

param = [255, 254, 252, 248, 240, 224, 192, 128, 0]
for A in param:
    net = ip_network(f'246.51.128.202/255.255.{A}.0', False)

    c = 0
    for ip in net:
        binary = bin(int(ip))[2:].zfill(32)
        if binary[:16].count('0') <= binary[16:].count('0'):
            c += 1

    if c == len(set(net)):
        print(A)

# 2 СПОСОБ

def proverka(ip):
    binary = bin(int(ip))[2:].zfill(32)
    return binary[:16].count('0') <= binary[16:].count('0')

for A in param:
    net = ip_network(f'246.51.128.202/255.255.{A}.0', False)

    if all(proverka(ip) == 1 for ip in net):
        print(A)