# Сколько существует целых значений параметра А, при которых выражение

# ((𝐴<𝑥)∨(𝑥^2−7𝑥+10>0))∧((𝐴≥𝑦)∨(𝑦^2+7𝑦+12>0))

# истинно, при любых целых значениях x и y.


def f(x, y):
    return ((A < x) or (x ** 2 - 7 * x + 10 > 0)) and ((A >= y) or (y ** 2 + 7 * y + 12 > 0))

c = 0
for A in range(-100, 1000):
    if all(f(x, y) == 1 for x in range(-100, 1000) for y in range(-100, 1000)):
        c += 1
print(c)