# На числовой прямой даны два отрезка: B = [36; 75] и C = [60; 110].
# Укажите наименьшую возможную длину такого отрезка A, что логическое выражение
#
# ¬(𝑥 ∈ 𝐴) → ((𝑥 ∈ 𝐵) ≡ (𝑥 ∈ 𝐶))
#
# истинно (т.е. принимает значение 1) при любом значении переменной х.

def f(x):
    B = 36 <= x <= 75
    C = 60 <= x <= 110
    A = a1 <= x <= a2

    return ((not A) <= (B == C))

r = []
d = [35.9, 36, 36.1, 74.9, 75, 75.1, 59.9, 60, 60.1, 109.9, 110, 110.1]

for a1 in d:
    for a2 in d:
        if a2 >= a1 and all(f(x) == 1 for x in d):
            r.append(a2 - a1)
print(round(min(r)))