# Для какого наименьшего целого положительного числа А выражение
# (𝑥<𝐴)∧(𝑦<3𝐴)∨(2𝑥+𝑦>128)
# истинно (т.е. принимает значение 1) при любых целых положительных х и у?

def f(x, y):
    return (x < A) and (y < 3 * A) or (2 * x + y > 128)

for A in range(1, 1000):
    if all(f(x, y) == 1 for x in range(1, 1000) for y in range(1, 1000)):
        print(A)



# for A in range(1, 1000):
#     c = 0
#     for x in range(1, 1000):
#         for y in range(1, 1000):
#             if f(x, y) == 1:
#                 c += 1
#     if c == 999 * 999:
#         print(A)