# На числовой прямой даны два отрезка: В=[54;120] и С=[78;151].
# Укажите наименьшую возможную длину такого отрезка 𝐴, для которого логическое выражение
#
# (𝑥 ∈ С)→(((𝑥 ∈ 𝐵)∧¬(𝑥 ∈ 𝐴))→¬(𝑥 ∈ 𝐶))
#
# тождественно истинно (т.е. принимает значение 1) при любом значении переменной 𝑥.

def f(x):
    B = 54 <= x <= 120
    C = 78 <= x <= 151
    A = a1 <= x <= a2

    return (C <= ((B and (not A)) <= (not C)))

r = []
d = [53.9, 54, 54.1, 119.9, 120, 120.1, 77.9, 78, 78.1, 150.9, 151, 151.1]

for a1 in d:
    for a2 in d:
        if a2 >= a1 and all(f(x) == 1 for x in d):
            r.append(a2 - a1)
print(round(min(r)))