# Определите в 25-ричной записи числа
# количество цифр с числовым значением, превышающим 10
#
# 4⋅3125^2019+3⋅625^2020−2⋅125^2021+25^2022−4⋅5^2023 - 2024.

# 1 Вариант
n = 4 * 3125 ** 2019 + 3 * 625 ** 2020 - 2 * 125 ** 2021 + 25 ** 2022 - 4 * 5 ** 2023 - 2024
c = 0
while n > 0:
    if 10 < (n % 25) < 25:
        c = c + 1
    n = n // 25
print(c)

# 2 Вариант
n = 4 * 3125 ** 2019 + 3 * 625 ** 2020 - 2 * 125 ** 2021 + 25 ** 2022 - 4 * 5 ** 2023 - 2024
c = 0
while n > 0:
    if n % 25 > 10:
        c = c + 1
    n = n // 25
print(c)