# Алгоритм вычисления функций 𝐹(𝑛) и 𝐺(𝑛),
# где 𝑛 - целое число, задан следующими соотношениями:
#
# 𝐹(𝑛)= 𝐹(𝑛+4)+3020, если 𝑛<31054;
# 𝐹(𝑛)=3×(𝐺(𝑛−2)−15), если 𝑛≥31054;
#
# 𝐺(𝑛)=𝐺(𝑛−5)−15, если 𝑛≥28;
# 𝐺(𝑛)=3×𝑛−4, если 𝑛<28.
#
# Чему равно значение функции 𝐹(15)?

from functools import *

@lru_cache(None)
def f(n):
    if n < 31054: return f(n + 4) + 3020
    if n >= 31054: return 3 * (g(n - 2) - 15)

@lru_cache(None)
def g(n):
    if n >= 28: return g(n - 5) - 15
    if n < 28: return 3 * n - 4

for n in range(32000):
    g(n)

for n in range(32000, 0, -1):
    f(n)

print(f(15))